* intro
  Simple V0 version of a state machine DSL.  See comments in test.lisp for details.
* use
#+name: dsl
#+begin_src lisp :results output
  #| checks that :state-dsl/use can be loaded |#
 (uiop:run-program "rm -rf ~/.cache/common-lisp ;
 rm -rf ~/quicklisp/local-projects/*.fasl ;
 rm -rf ~/quicklisp/local/projects/*~")
 (ql:quickload :state-dsl/use)
#+end_src

* generate
#+name: dsl
#+begin_src lisp :results output
 (uiop:run-program "rm -rf ~/.cache/common-lisp ;
 rm -rf ~/quicklisp/local-projects/*.fasl ;
 rm -rf ~/quicklisp/local/projects/*~")
 (ql:quickload :state-dsl/generate)
#+end_src

#+name: dsl
#+begin_src lisp :results output
  #| generates state-dsl.lisp |#
 (state-dsl::generate)
#+end_src

#+RESULTS: dsl
: To load "state-dsl/use":
:   Load 1 ASDF system:
:     state-dsl/use
: ; Loading "state-dsl/use"
: .

